{
  "title": "WD-40 Multi-Use 330ml Spray Aerosol Can All-Purpose Lubricant, Cleans Rust, for Home & Workshop Use",
  "brand": "WD-40",
  "asin": "B07MX3F36F",
  "price": {
    "current_price": 17.4,
    "original_price": null,
    "currency": "AED",
    "discount_percent": null
  },
  "reviews": {
    "total_reviews": 1801,
    "average_rating": 4.5,
    "highlights": [],
    "top_positive": null,
    "top_critical": null
  },
  "rating": 4.5,
  "raw_desc": "Ultimate Lubricant in a Spray: WD-40 Multi-Use Product is the original all-round household essential, providing superior lubrication. Protects from Rust and Corrosion: In addition to greasing, it displaces moisture, safeguarding machines and mechanisms. Penetrates and Frees Stuck Parts: Effectively penetrates and lubricates stuck parts or components, making it versatile for various applications. Eliminates Squeaks and Creaks: Say goodbye to annoying squeaks and creaks with WD-40 Multi-Use Product. Multi-Functional Household Essential: An indispensable product that serves various purposes around the house and workshop.",
  "features": [
    "Ultimate Lubricant in a Spray: WD-40 Multi-Use Product is the original all-round household essential, providing superior lubrication.",
    "Protects from Rust and Corrosion: In addition to greasing, it displaces moisture, safeguarding machines and mechanisms.",
    "Penetrates and Frees Stuck Parts: Effectively penetrates and lubricates stuck parts or components, making it versatile for various applications.",
    "Eliminates Squeaks and Creaks: Say goodbye to annoying squeaks and creaks with WD-40 Multi-Use Product.",
    "Multi-Functional Household Essential: An indispensable product that serves various purposes around the house and workshop."
  ],
  "url": "https://www.amazon.ae/WD-40-Multi-Use-All-Purpose-Lubricant-Workshop/dp/B07MX3F36F",
  "affiliate_link": "https://www.amazon.ae/WD-40-Multi-Use-All-Purpose-Lubricant-Workshop/dp/B07MX3F36F?tag=techdealsuae-21",
  "website_link": "https://aismartchoice.com/product/B07MX3F36F"
}