{
  "title": "WaterWipes Original Plastic Free Baby Wipes, 720 wet wipes (12 packs)",
  "brand": "WaterWipes",
  "asin": "B08MXSBRSB",
  "price": {
    "current_price": 146.0,
    "original_price": 225.0,
    "currency": "AED",
    "discount_percent": 35.1
  },
  "reviews": {
    "total_reviews": 26505,
    "average_rating": 4.5,
    "highlights": [],
    "top_positive": null,
    "top_critical": null
  },
  "rating": 4.5,
  "raw_desc": "GENTLY CLEANS & HELPS PROTECT SENSITIVE SKIN: Our free from artificial fragrance Original baby wipes gently cleanse baby’s sensitive skin with just 2 ingredients: 99.9% purified water and a drop of fruit extract. IDEAL FOR PREMATURE & NEWBORN SKIN: The purest skin deserves the world’s purest baby wipes. Our WaterWipes are gentle enough for the most sensitive premature; infant and newborn skin. PLASTIC FREE* WIPES: Our Original baby wet wipes are plastic free*. Plus, they’re unscented and contain no artificial fragrances. *The claim does not refer to the full product lifecycle nor the external plastic packing and relates to the wipes only. TRUSTED BY DERMATOLOGISTS: Suitable for eczema-prone skin and allergy sufferers; WaterWipes have been awarded the National Eczema Association Seal of Acceptance; are approved by Allergy UK & the Skin Health Alliance and registered by the Vegan Society. MORE EVERYDAY USES: WaterWipes are ideal for all occasions. Reach for them to clean small messes on skin & clothes and to refresh skin in warmer weather; keep them in your gym bag or car to clean on-the-go.",
  "features": [
    "GENTLY CLEANS & HELPS PROTECT SENSITIVE SKIN: Our free from artificial fragrance Original baby wipes gently cleanse baby’s sensitive skin with just 2 ingredients: 99.9% purified water and a drop of fruit extract.",
    "IDEAL FOR PREMATURE & NEWBORN SKIN: The purest skin deserves the world’s purest baby wipes. Our WaterWipes are gentle enough for the most sensitive premature; infant and newborn skin.",
    "PLASTIC FREE* WIPES: Our Original baby wet wipes are plastic free*. Plus, they’re unscented and contain no artificial fragrances. *The claim does not refer to the full product lifecycle nor the external plastic packing and relates to the wipes only.",
    "TRUSTED BY DERMATOLOGISTS: Suitable for eczema-prone skin and allergy sufferers; WaterWipes have been awarded the National Eczema Association Seal of Acceptance; are approved by Allergy UK & the Skin Health Alliance and registered by the Vegan Society.",
    "MORE EVERYDAY USES: WaterWipes are ideal for all occasions. Reach for them to clean small messes on skin & clothes and to refresh skin in warmer weather; keep them in your gym bag or car to clean on-the-go."
  ],
  "url": "https://www.amazon.ae/WaterWipes-Original-Plastic-Wipes-wipes/dp/B08MXSBRSB",
  "affiliate_link": "https://www.amazon.ae/WaterWipes-Original-Plastic-Wipes-wipes/dp/B08MXSBRSB?tag=techdealsuae-21",
  "website_link": "https://aismartchoice.com/product/B08MXSBRSB"
}