{
  "title": "Hisense 7Kg Front Loading Washing Machine 1200 Rpm Silver Model Wfpv7012Mt -1 Years Full Warranty.",
  "brand": "Hisense",
  "asin": "B095N62ZXC",
  "price": {
    "current_price": 685.0,
    "original_price": null,
    "currency": "AED",
    "discount_percent": null
  },
  "reviews": {
    "total_reviews": 329,
    "average_rating": 3.3,
    "highlights": [],
    "top_positive": null,
    "top_critical": null
  },
  "rating": 3.3,
  "raw_desc": "Hisense 7Kg Front Loading Washing Machine 1200 RPM Silver Model WFPV7012MT -1 Years Full Warranty. We focus on developing premium washing machines, with superior-cleaning and ease-of-use principle at the forefront of our minds. This product features superb functions such as baby care, quick wash and drum clean. A feature allowing you to load the machine and select your preferred washing end time. This is useful to take advantage of lower utility rates or to avoid the unwanted noise of the machine at certain times in the day, easy and convenient. The snowflake shape drum design will wash your clothes cleaner, as well as provide enhanced protection and care for your clothes. The Hisense Drum Clean allows you to keep your washing machine in the best condition by giving it a 95℃ deep clean.",
  "features": [
    "Hisense 7Kg Front Loading Washing Machine 1200 RPM Silver Model WFPV7012MT -1 Years Full Warranty.",
    "We focus on developing premium washing machines, with superior-cleaning and ease-of-use principle at the forefront of our minds. This product features superb functions such as baby care, quick wash and drum clean.",
    "A feature allowing you to load the machine and select your preferred washing end time. This is useful to take advantage of lower utility rates or to avoid the unwanted noise of the machine at certain times in the day, easy and convenient.",
    "The snowflake shape drum design will wash your clothes cleaner, as well as provide enhanced protection and care for your clothes.",
    "The Hisense Drum Clean allows you to keep your washing machine in the best condition by giving it a 95℃ deep clean."
  ],
  "url": "https://www.amazon.ae/Hisense-Loading-Washing-Wfpv7012Mt-Warranty/dp/B095N62ZXC",
  "affiliate_link": "https://www.amazon.ae/Hisense-Loading-Washing-Wfpv7012Mt-Warranty/dp/B095N62ZXC?tag=techdealsuae-21",
  "website_link": "https://aismartchoice.com/product/B095N62ZXC"
}