{
  "title": "Samsung 7Kg Front Load Washing Machine With Quick Wash, Drum Clean And Delay End.\"Min 1 year manufacturer warranty\" (UAE version)",
  "price": {
    "current_price": 791.5,
    "original_price": 1399.0,
    "currency": "AED",
    "discount_percent": 43.4
  },
  "raw_desc": "Clean lightly soiled clothes quickly and efficiently. The Quick Wash program can get small loads of washing* clean in just 18 minutes**. Use this for great results and to save time when you are in a hurry or want to avoid having a big pile of laundry. Keep the inside of your washing machine hygienically clean and fresh, while being eco-friendly and saving money. Drum Clean removes detergent residue and dirt from inside the drum by using a combination of soaking, pulsating and high-speed spinning. Avoid leaving damp clothes in the washer for too long. The Delay End feature lets you pre-set a wash cycle to end up to 24 hours later. It means you can start the washing at night, but set it to finish for whenever you need, so it still smells fresh. Digital Inverter Technology utilizes strong magnets for a quieter* and more powerful performance while consuming less energy than a Universal Motor. By eliminating the use of brushes, it provides outstanding durability. The wide LED display is extremely clear and easy to read. You can quickly check the washing status, program settings, remaining time and cycle progress. And with a choice of 14 programs you can optimize the washing performance and fabric care.",
  "features": [
    "Clean lightly soiled clothes quickly and efficiently. The Quick Wash program can get small loads of washing* clean in just 18 minutes**. Use this for great results and to save time when you are in a hurry or want to avoid having a big pile of laundry.",
    "Keep the inside of your washing machine hygienically clean and fresh, while being eco-friendly and saving money. Drum Clean removes detergent residue and dirt from inside the drum by using a combination of soaking, pulsating and high-speed spinning.",
    "Avoid leaving damp clothes in the washer for too long. The Delay End feature lets you pre-set a wash cycle to end up to 24 hours later. It means you can start the washing at night, but set it to finish for whenever you need, so it still smells fresh.",
    "Digital Inverter Technology utilizes strong magnets for a quieter* and more powerful performance while consuming less energy than a Universal Motor. By eliminating the use of brushes, it provides outstanding durability.",
    "The wide LED display is extremely clear and easy to read. You can quickly check the washing status, program settings, remaining time and cycle progress. And with a choice of 14 programs you can optimize the washing performance and fabric care."
  ],
  "rating": 3.8,
  "url": "https://www.amazon.ae/Samsung-Washing-Machine-manufacturer-warranty/dp/B092H23GDM"
}